// script.js

// Array of random quotes
const quotes = [
  'Життя – це те, що з тобою відбувається, поки ти будуєш плани, – Джон Леннон.',
  'Той, хто не досить сміливий, щоб ризикувати – нічого і не доб’ється у житті, – Мохаммед Алі.',
  'Ваше благополуччя залежить від ваших власних рішень, – Джон Д. Рокфеллер.',
  'Найскладніше почати діяти, все інше залежить тільки від наполегливості, – Амелія Ергарт.',
  'Успіх – це здатність крокувати від однієї невдачі до іншої, не втрачаючи ентузіазму, – Вінстон Черчилль.',
  'Не важливо, як повільно ти просуваєшся, головне, що ти не зупиняєшся, – Конфуцій.»',
  '«Ти можеш говорити, що у тебе погана генетика, поганий обмін речовин, а можеш просто підняти свою дупу з дивана і почати працювати над собою, поставити собі мету і вірити в себе. У цьому випадку ти обов’язково досягнеш успіху, – Арнольд Шварценеггер.»',
];

// Получить элементы из DOM
const quoteText = document.getElementById('quote-text');
const quoteButton = document.getElementById('quote-button');

// Функция генерации случайной цитаты
function getRandomQuote() {
  const randomIndex = Math.floor(Math.random() * quotes.length);
  console.log(randomIndex);
  quoteText.textContent = quotes[randomIndex];
}

// Прослушиватель событий для кнопки
quoteButton.addEventListener('click', getRandomQuote);
